Router#CONFI
Router#CONFIgure 
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#
Router(config)#AC
Router(config)#ACcess-list 1 PER
Router(config)#ACcess-list 1 PERmit 10.0.0.0 0.255.255.255 ?
  <cr>
Router(config)#ACcess-list 1 PERmit 10.0.0.0 0.255.255.255 
Router(config)#IP NAT
Router(config)#IP NAT ?
  inside   Inside address translation
  outside  Outside address translation
  pool     Define pool of addresses
Router(config)#IP NAT POO
Router(config)#IP NAT POOl JETKING ?
  A.B.C.D  Start IP address
Router(config)#IP NAT POOl JETKING 122.1.1.1 122.1.1.4 ?
  netmask  Specify the network mask
Router(config)#IP NAT POOl JETKING 122.1.1.1 122.1.1.4 NET
Router(config)#IP NAT POOl JETKING 122.1.1.1 122.1.1.4 NETmask 255.255.255.0 ?
  <cr>
Router(config)#IP NAT POOl JETKING 122.1.1.1 122.1.1.4 NETmask 255.255.255.0 
Router(config)#IP NAT
Router(config)#IP NAT ?
  inside   Inside address translation
  outside  Outside address translation
  pool     Define pool of addresses
Router(config)#IP NAT IN
Router(config)#IP NAT INside SO
Router(config)#IP NAT INside SOurce LI
Router(config)#IP NAT INside SOurce LIst 1 POO
Router(config)#IP NAT INside SOurce LIst 1 POOl JETKING
Router(config)#IP NAT INside SOurce LIst 1 POOl JETKING?
WORD  
Router(config)#IP NAT INside SOurce LIst 1 POOl JETKING
Router(config)#INT F0/0
Router(config-if)#IP NAT
Router(config-if)#IP NAT IN
Router(config-if)#IP NAT INside 
Router(config-if)#ZCONFI
Router(config-if)#^Z
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#
Router#
Router#
Router#
Router#
Router#CONFI
Router#CONFIgure 
Configuring from terminal, memory, or network [terminal]? 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#
Router(config)#
Router(config)#INT S0/0
Router(config-if)#IP NA
Router(config-if)#IP NAt O
Router(config-if)#IP NAt Outside ^Z
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#
Router#
Router#
Router#
Router#
Router#
Router#SH
Router#SHow IP NAT TR
Router#SHow IP NAT TRanslations 
Router#SHow IP NAT TRanslations 
Pro  Inside global     Inside local       Outside local      Outside global
icmp 122.1.1.1:5       10.0.0.2:5         204.1.1.10:5       204.1.1.10:5
icmp 122.1.1.1:6       10.0.0.2:6         204.1.1.10:6       204.1.1.10:6
icmp 122.1.1.1:7       10.0.0.2:7         204.1.1.10:7       204.1.1.10:7
icmp 122.1.1.1:8       10.0.0.2:8         204.1.1.10:8       204.1.1.10:8
tcp 122.1.1.2:1026     10.0.0.3:1026      204.1.1.10:80      204.1.1.10:80

Router#SHow IP NAT TRanslations 
Pro  Inside global     Inside local       Outside local      Outside global
tcp 122.1.1.2:1026     10.0.0.3:1026      204.1.1.10:80      204.1.1.10:80
tcp 122.1.1.3:1025     10.0.0.4:1025      204.1.1.10:80      204.1.1.10:80

Router#